In [73]:
import pandas as pd

In [74]:
df=pd.read_csv("data1.csv")

In [75]:
df.isnull()

     Name    Age   City  Gender  Email  Join Date
0   False  False  False   False  False      False
1   False   True  False   False  False      False
2   False  False  False   False  False      False
3   False  False  False   False  False      False
4   False   True  False   False  False      False
5   False  False  False   False  False      False
6    True  False  False   False  False       True
7   False  False  False   False  False      False
8   False  False  False   False  False      False
9   False   True  False   False  False      False
10  False   True  False   False  False      False
11  False  False  False   False  False      False
12   True  False  False   False  False       True
13  False  False  False   False  False      False
14  False  False  False   False  False      False

In [76]:
df.isnull().sum()

Name         2
Age          4
City         0
Gender       0
Email        0
Join Date    2
dtype: int64

In [77]:
df.dropna()

     Name   Age         City Gender              Email   Join Date
0   Alice  25.0     New York      F  alice@example.com  01-05-2021
2   Alice  25.0     New York      F  alice@example.com  01-05-2021
3     Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
5   David  22.0       Mumbai      M  david@example.com  12-11-2019
7   Alice  25.0     New York      F  alice@example.com  01-05-2021
8   Alice  25.0     New York      F  alice@example.com  01-05-2021
11  David  22.0       Mumbai      M  david@example.com  12-11-2019
13  Alice  25.0     New York      F  alice@example.com  01-05-2021
14  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [78]:
df.dropna(axis=1)

           City Gender              Email
0      New York      F  alice@example.com
1         Delhi      M    charlie@example
2      New York      F  alice@example.com
3   Los Angeles      M    bob@example.com
4         Delhi      M    charlie@example
5        Mumbai      M  david@example.com
6         Delhi      F     eve@domain.com
7      New York      F  alice@example.com
8      New York      F  alice@example.com
9         Delhi      M    charlie@example
10        Delhi      M    charlie@example
11       Mumbai      M  david@example.com
12        Delhi      F     eve@domain.com
13     New York      F  alice@example.com
14     New York      F  alice@example.com

In [79]:
df.fillna(0)

       Name   Age         City Gender              Email   Join Date
0     Alice  25.0     New York      F  alice@example.com  01-05-2021
1   Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2     Alice  25.0     New York      F  alice@example.com  01-05-2021
3       Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4   Charlie   0.0        Delhi      M    charlie@example  20-07-2021
5     David  22.0       Mumbai      M  david@example.com  12-11-2019
6         0  28.0        Delhi      F     eve@domain.com           0
7     Alice  25.0     New York      F  alice@example.com  01-05-2021
8     Alice  25.0     New York      F  alice@example.com  01-05-2021
9   Charlie   0.0        Delhi      M    charlie@example  20-07-2021
10  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
11    David  22.0       Mumbai      M  david@example.com  12-11-2019
12        0  28.0        Delhi      F     eve@domain.com           0
13    Alice  25.0     New York      F  alice@example.com  01-05-2021
14    Alice  25.0     New York      F  alice@example.com  01-05-2021

In [80]:
df.fillna(df["Age"].mean())

         Name        Age         City Gender              Email   Join Date
0       Alice  25.000000     New York      F  alice@example.com  01-05-2021
1     Charlie  25.454545        Delhi      M    charlie@example  20-07-2021
2       Alice  25.000000     New York      F  alice@example.com  01-05-2021
3         Bob  30.000000  Los Angeles      M    bob@example.com  15-06-2020
4     Charlie  25.454545        Delhi      M    charlie@example  20-07-2021
5       David  22.000000       Mumbai      M  david@example.com  12-11-2019
6   25.454545  28.000000        Delhi      F     eve@domain.com   25.454545
7       Alice  25.000000     New York      F  alice@example.com  01-05-2021
8       Alice  25.000000     New York      F  alice@example.com  01-05-2021
9     Charlie  25.454545        Delhi      M    charlie@example  20-07-2021
10    Charlie  25.454545        Delhi      M    charlie@example  20-07-2021
11      David  22.000000       Mumbai      M  david@example.com  12-11-2019
12  25.454545  28.000000        Delhi      F     eve@domain.com   25.454545
13      Alice  25.000000     New York      F  alice@example.com  01-05-2021
14      Alice  25.000000     New York      F  alice@example.com  01-05-2021

In [81]:
# df.fillna(method="ffill")
#or
df.ffill()

       Name   Age         City Gender              Email   Join Date
0     Alice  25.0     New York      F  alice@example.com  01-05-2021
1   Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2     Alice  25.0     New York      F  alice@example.com  01-05-2021
3       Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4   Charlie  30.0        Delhi      M    charlie@example  20-07-2021
5     David  22.0       Mumbai      M  david@example.com  12-11-2019
6     David  28.0        Delhi      F     eve@domain.com  12-11-2019
7     Alice  25.0     New York      F  alice@example.com  01-05-2021
8     Alice  25.0     New York      F  alice@example.com  01-05-2021
9   Charlie  25.0        Delhi      M    charlie@example  20-07-2021
10  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
11    David  22.0       Mumbai      M  david@example.com  12-11-2019
12    David  28.0        Delhi      F     eve@domain.com  12-11-2019
13    Alice  25.0     New York      F  alice@example.com  01-05-2021
14    Alice  25.0     New York      F  alice@example.com  01-05-2021

In [82]:
# df.fillna(method="bfill")
# or
df.bfill()

       Name   Age         City Gender              Email   Join Date
0     Alice  25.0     New York      F  alice@example.com  01-05-2021
1   Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2     Alice  25.0     New York      F  alice@example.com  01-05-2021
3       Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4   Charlie  22.0        Delhi      M    charlie@example  20-07-2021
5     David  22.0       Mumbai      M  david@example.com  12-11-2019
6     Alice  28.0        Delhi      F     eve@domain.com  01-05-2021
7     Alice  25.0     New York      F  alice@example.com  01-05-2021
8     Alice  25.0     New York      F  alice@example.com  01-05-2021
9   Charlie  22.0        Delhi      M    charlie@example  20-07-2021
10  Charlie  22.0        Delhi      M    charlie@example  20-07-2021
11    David  22.0       Mumbai      M  david@example.com  12-11-2019
12    Alice  28.0        Delhi      F     eve@domain.com  01-05-2021
13    Alice  25.0     New York      F  alice@example.com  01-05-2021
14    Alice  25.0     New York      F  alice@example.com  01-05-2021

In [83]:
df.duplicated()

0     False
1     False
2      True
3     False
4      True
5     False
6     False
7      True
8      True
9      True
10     True
11     True
12     True
13     True
14     True
dtype: bool

In [84]:
df.drop_duplicates()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
3      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
5    David  22.0       Mumbai      M  david@example.com  12-11-2019
6      NaN  28.0        Delhi      F     eve@domain.com         NaN

In [85]:
df["Name"].str.lower() # Converts all names to lowercase.

0       alice
1     charlie
2       alice
3         bob
4     charlie
5       david
6         NaN
7       alice
8       alice
9     charlie
10    charlie
11      david
12        NaN
13      alice
14      alice
Name: Name, dtype: object

In [86]:
a=df["City"].str.contains("delhi", case=False) # Checks if 'delhi' is in the city name, case-insensitive.
print(type(a))
a

<class 'pandas.core.series.Series'>

0     False
1      True
2     False
3     False
4      True
5     False
6      True
7     False
8     False
9      True
10     True
11    False
12     True
13    False
14    False
Name: City, dtype: bool

In [87]:
df["Email"].str.split("@") # Outputs a pandas Series where each element is a list of strings (the split parts). This is where a Python list comes into play, but the outer object is still a pandas Series.

0     [alice, example.com]
1       [charlie, example]
2     [alice, example.com]
3       [bob, example.com]
4       [charlie, example]
5     [david, example.com]
6        [eve, domain.com]
7     [alice, example.com]
8     [alice, example.com]
9       [charlie, example]
10      [charlie, example]
11    [david, example.com]
12       [eve, domain.com]
13    [alice, example.com]
14    [alice, example.com]
Name: Email, dtype: object

In [88]:
df2=df.dropna().copy()
df2["Age"]=df2["Age"].astype(int)
df2

     Name  Age         City Gender              Email   Join Date
0   Alice   25     New York      F  alice@example.com  01-05-2021
2   Alice   25     New York      F  alice@example.com  01-05-2021
3     Bob   30  Los Angeles      M    bob@example.com  15-06-2020
5   David   22       Mumbai      M  david@example.com  12-11-2019
7   Alice   25     New York      F  alice@example.com  01-05-2021
8   Alice   25     New York      F  alice@example.com  01-05-2021
11  David   22       Mumbai      M  david@example.com  12-11-2019
13  Alice   25     New York      F  alice@example.com  01-05-2021
14  Alice   25     New York      F  alice@example.com  01-05-2021

In [89]:
df["Age Group"] = df["Age"].apply(lambda x: "Adult" if x >= 18 else "Minor")
df

       Name   Age         City Gender              Email   Join Date Age Group
0     Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
1   Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
2     Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
3       Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020     Adult
4   Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
5     David  22.0       Mumbai      M  david@example.com  12-11-2019     Adult
6       NaN  28.0        Delhi      F     eve@domain.com         NaN     Adult
7     Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
8     Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
9   Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
10  Charlie   NaN        Delhi      M    charlie@example  20-07-2021     Minor
11    David  22.0       Mumbai      M  david@example.com  12-11-2019     Adult
12      NaN  28.0        Delhi      F     eve@domain.com         NaN     Adult
13    Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult
14    Alice  25.0     New York      F  alice@example.com  01-05-2021     Adult

In [90]:
gender_map = {"M": "Male", "F": "Female"}
df["Gender"] = df["Gender"].map(gender_map)
df

,Name,Age,City,Gender,Email,Join Date,Age Group
0,Alice,25.0,New York,Female,alice@example.com,01-05-2021,Adult
1,Charlie,NaN,Delhi,Male,charlie@example,20-07-2021,Minor
2,Alice,25.0,New York,Female,alice@example.com,01-05-2021,Adult
3,Bob,30.0,Los Angeles,Male,bob@example.com,15-06-2020,Adult
4,Charlie,NaN,Delhi,Male,charlie@example,20-07-2021,Minor
5,David,22.0,Mumbai,Male,david@example.com,12-11-2019,Adult
6,NaN,28.0,Delhi,Female,eve@domain.com,NaN,Adult
7,Alice,25.0,New York,Female,alice@example.com,01-05-2021,Adult
8,Alice,25.0,New York,Female,alice@example.com,01-05-2021,Adult
9,Charlie,NaN,Delhi,Male,charlie@example,20-07-2021,Minor
10,Charlie,NaN,Delhi,Male,charlie@example,20-07-2021,Minor
11,David,22.0,Mumbai,Male,david@example.com,12-11-2019,Adult
12,NaN,28.0,Delhi,Female,eve@domain.com,NaN,Adult
13,Alice,25.0,New York,Female,alice@example.com,01-05-2021,Adult
14,Alice,25.0,New York,Female,alice@example.com,01-05-2021,Adult

In [91]:
df["City"].replace({"Del": "Delhi", "Mum": "Mumbai"})

0        New York
1           Delhi
2        New York
3     Los Angeles
4           Delhi
5          Mumbai
6           Delhi
7        New York
8        New York
9           Delhi
10          Delhi
11         Mumbai
12          Delhi
13       New York
14       New York
Name: City, dtype: object